#----------------------------------------------------------------------------#
#                     *** ФОРМАТ TLE И АЛГОРИТМ SGP4 ***                     #
#                                                                            #
# Проект для Qt 5                                                            #
#                                                                            #
# Автор ГЛУЩЕНКО Сергей                                                      #
#                                                                            #
#                                                           Москва, 2022 год #
#----------------------------------------------------------------------------#

QT -= gui

TARGET = Test  #Имя исполняемого файла
TEMPLATE = app

CONFIG += c++11 console

DEFINES += QT_DEPRECATED_WARNINGS

DESTDIR = $$PWD/Application  #Размещение исполняемого файла

SOURCES += \
    TestMain.cpp \
    ../TLE_SGP4.cpp

HEADERS += \
    ../TLE_SGP4.h
